"""
字典练习: 升职加薪
"""

#定义字典
dict1 = {"王力宏": {
    "部门": "科技部",
    "工资": 3000,
    "级别": 1
}, "周杰伦": {
    "部门": "市场部",
    "工资": 5000,
    "级别": 2
}, "林俊杰": {
    "部门": "市场部",
    "工资": 7000,
    "级别": 3
}, "张学友": {
    "部门": "科技部",
    "工资": 4000,
    "级别": 1
}, "刘德华": {
    "部门": "市场部",
    "工资": 6000,
    "级别": 2
}
}

print(f"全体员工当前信息如下: {dict1}")

# 通过for循环, 对所有级别为1级的员工, 级别上升一级, 薪水增加1000元
for key in dict1:
    if dict1[key]["级别"] == 1:
        dict1[key]["级别"] += 1
        dict1[key]["工资"] += 1000

# 输出结果
print(f"全体员工级别为1的员工完成升职加薪操作, 操作后: {dict1}")